arduino-nano-install-python.html
<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="utf-8">
    <title>borborygmi</title>
    <meta name="description" content="">
    <meta name="author" content="Noah Hoffman">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

    <!-- Le HTML5 shim, for IE6-8 support of HTML elements -->
    <!--[if lt IE 9]>
    <![endif]-->

    <!-- Le styles -->
    <link href="https://nhoffman.github.io/borborygmi/theme/bootstrap.min.css" rel="stylesheet">
    <link href="https://nhoffman.github.io/borborygmi/theme/bootstrap.min.responsive.css" rel="stylesheet">
    <link href="https://nhoffman.github.io/borborygmi/theme/local.css" rel="stylesheet">
    <link href="https://nhoffman.github.io/borborygmi/theme/pygments.css" rel="stylesheet">

</head>

<body>

<div class="navbar">
    <div class="navbar-inner">
    <div class="container">

         <a class="btn btn-navbar" data-toggle="collapse" data-target=".nav-collapse">
             <span class="icon-bar"></span>
             <span class="icon-bar"></span>
             <span class="icon-bar"></span>
         </a>

        <a class="brand" href="https://nhoffman.github.io/borborygmi">borborygmi</a>

        <div class="nav-collapse">
        <ul class="nav">

        </ul>
        </div>

    </div>
    </div>
</div>

<div class="container">
    <div class="content">
    <div class="row">

        <div class="span9">
  <div class='article'>
    <div class="content-title">
      <h1>Python on an Arduino Nano RP2040 Connect</h1>
Sat 10 June 2023 &#8212;


<em>Filed under <a href="https://nhoffman.github.io/borborygmi/category/projects.html">projects</a>;
    tags: <a href="https://nhoffman.github.io/borborygmi/tag/python.html">python,&nbsp;</a><a href="https://nhoffman.github.io/borborygmi/tag/arduino.html">arduino</a></em>    </div>

    <div><div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbf86744">Installing the .u2f file</a></li>
<li><a href="#org9af4891">s/MicroPython/CircuitPython</a></li>
</ul>
</div>
</div>
<p>
I recently purchased an <a href="https://store-usa.arduino.cc/products/arduino-nano-rp2040-connect-with-headers">Arduino Nano RP2040 Connect</a> with the hope of
running <a href="https://micropython.org">MicroPython</a> (one of the useful side effects of having kids is
an excuse to buy stuff for projects). It's worth noting a couple of
the issues that came up.
</p>

<div id="outline-container-orgbf86744" class="outline-2">
<h2 id="orgbf86744">Installing the .u2f file</h2>
<div class="outline-text-2" id="text-orgbf86744">
<p>
First, there appears to be a known problem with the documented method
for copying .uf2 files to a connected board from a Mac running MacOS
13 Ventura. This involves placing the board into boot mode, and simply
dropping the .uf2 file into the mounted volume in the Finder. The
problem (and the solution that I'll mention below) is documented in
the <a href="https://blog.smittytone.net/2022/11/12/how-to-copy-files-to-a-pico-on-a-ventura-mac-error-free">smittytone blog</a>. Actually, the author offers a few possible
solutions, but the one I used was to run the command
</p>

<pre class="example">
stty -f /dev/cu.usbmodem1101 1200
</pre>


<p>
Where <code>/dev/cu.usbmodem1101</code> was the file matching the expected
pattern that appeared when the board was connected. After I ran this
command, a volume appeared in the Finder, and I was simply able to
copy the .u2f file from the command line:
</p>

<pre class="example">
cp ~/Downloads/adafruit-circuitpython-arduino_nano_rp2040_connect-en_US-8.1.0.uf2 /Volumes/RPI-RP2
</pre>
</div>
</div>

<div id="outline-container-org9af4891" class="outline-2">
<h2 id="org9af4891">s/MicroPython/CircuitPython</h2>
<div class="outline-text-2" id="text-org9af4891">
<p>
You may notice from the command above that I'm not installing
MicroPython at all. Well, after many attempts to connect to the python
interpreter after installing MicroPython, I found various reports of
difficulties getting it to run on the RP2040. Luckily, AdaFruit
maintains a project derived from MicroPython called <a href="https://learn.adafruit.com/welcome-to-circuitpython">CircuitPython</a>, and
provides a build for many boards, including <a href="https://circuitpython.org/board/arduino_nano_rp2040_connect/">mine</a>. So after downloading and installing this build as described above, I was able to connect!
</p>

<p>
So far so good&#x2026; hopefully in the next post will I'll be able to
describe doing something interesting.
</p>
</div>
</div>
</div>

    <hr>

  </div>
        </div>

        <div class="span3">

            <div class="well" style="padding: 8px 0; background-color: #FBFBFB;">
            <ul class="nav nav-list">
                <li class="nav-header">
                Site
                </li>

                <li><a href="https://nhoffman.github.io/borborygmi/">Archives</a>
                <li><a href="https://nhoffman.github.io/borborygmi/tags.html">Tags</a>
                <li><a href="https://nhoffman.github.io/borborygmi/" rel="alternate">Atom feed</a></li>
            </ul>
            </div>


            <div class="well" style="padding: 8px 0; background-color: #FBFBFB;">
            <ul class="nav nav-list">
                <li class="nav-header">
                Categories
                </li>

                <li><a href="https://nhoffman.github.io/borborygmi/category/lectures.html">lectures</a></li>
                <li><a href="https://nhoffman.github.io/borborygmi/category/notes.html">notes</a></li>
                <li><a href="https://nhoffman.github.io/borborygmi/category/org-mode.html">org-mode</a></li>
                <li><a href="https://nhoffman.github.io/borborygmi/category/projects.html">projects</a></li>
                <li><a href="https://nhoffman.github.io/borborygmi/category/python.html">python</a></li>
                <li><a href="https://nhoffman.github.io/borborygmi/category/sql.html">sql</a></li>
            </ul>
            </div>


            <div class="well" style="padding: 8px 0; background-color: #FBFBFB;">
            <ul class="nav nav-list">
                <li class="nav-header">
                Links
                </li>

                <li><a href="https://github.com/nhoffman">GitHub account</a></li>
                <li><a href="https://github.com/nhoffman/borborygmi">site source</a></li>
            </ul>
            </div>



        </div>     </div>     </div> 
<footer>
<br />
<p><a href="https://nhoffman.github.io/borborygmi">borborygmi</a> &copy; Noah Hoffman 2025</p>
</footer>

</div> <!-- /container -->


<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-16886766-2', 'auto');
  ga('send', 'pageview');
</script>
</body>
</html>